app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.active.paginate :per_page => 30, :page => params[:page]

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id], :include => [:users])

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES('test', '2010-03-04 04:00:04', '2010-03-04 04:00:04')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save