app/controllers/tasks_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 10)
---
  def load_project
    @project = Project.find(params[:project_id])

SELECT * FROM "tasks"
---
  def index
    @tasks = @project.tasks.parents.paginate(:per_page => 30, :page => params[:page], :include => :project)

SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
---
  def show
    @task = Task.find(params[:id], :include => :tasks)

INSERT INTO "tasks" ("name", "parent", "created_at", "project_id", "updated_at", "description") VALUES('test', NULL, '2010-03-04 04:30:54', 1, '2010-03-04 04:30:54', 'foo')
---
  def create
    params[:task][:project] = @project.id
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 3)
UPDATE "tasks" SET "updated_at" = '2010-03-04 04:39:25', "parent" = 1 WHERE "id" = 3
---
  def update
    params[:task][:project] = @project
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])